<?php

return [
    'contacts'  => [
        'datatable' => [
            'created_at'    => 'تاريخ الآنشاء',
            'date_range'    => 'البحث بالتواريخ',
            'email'         => 'البريد الالكتروني',
            'desc'          => 'الوصف',
            'contact'       => 'الخدمه',
            'image'         => 'الصورة الشخصية',
            'phone'        => 'الهاتف',
            'name'          => 'الاسم',
            'options'       => 'الخيارات',
            'file'          => 'الملف',
        ],
        'form'      => [
            'email'         => 'البريد الالكتروني',
            'desc'          => 'الوصف',
            'contact'       => 'الخدمه',
            'image'         => 'الصورة الشخصية',
            'phone'        => 'الهاتف',
            'name'          => 'الاسم',
            'options'       => 'الخيارات',
            'file'          => 'الملف',
            'tabs'              => [
                'general'   => 'بيانات عامة',
                'seo'       => 'SEO',
            ],
            'title'             => 'عنوان المقال',
            'type'              => 'نوع المقال',
            'video'             => 'رابط الفيديو',
        ],
        'index'     => [
            'title' => 'تواصل معنا',
        ],
        'routes' => [
            'index'     => ' تواصل معنا',
            'create'    => 'اضافة تواصل معنا',
            'update'    => 'تعديل تواصل معنا',

        ]

    ],
];
